/*********************************************
Translator.js for AkelPad - Interface language
Version:       2012-09-02
Language:      Ukrainian
Translated by: FeyFre
*********************************************/
sTxtCaption    = "Перекладач";
sTxtUse        = "Use";
sTxtFromLang   = "Із мови";
sTxtToLang     = "Мовою";
sTxtAutoDetect = "Автовизначення мови";
sTxtTranslate  = "&Перекласти";
sTxtTranslateP = "Перекласти+";
sTxtOptions    = "&Опції";
sTxtSource     = "Вхідний текст";
sTxtTarget     = "Переклад";
sTxtSettings   = "Налаштовування";
sTxtUndo       = "&Повернути";
sTxtRedo       = "&Повторити";
sTxtCut        = "&Вирізати";
sTxtCopyCB     = "&Копіювати до кишені";
sTxtInsertAP   = "&Вставити у AkelPad";
sTxtPasteCB    = "В&ставити із кишені";
sTxtPasteAP    = "Вс&тавити із AkelPad";
sTxtDelete     = "В&идалити";
sTxtSelectAll  = "Ви&ділити все";
sTxtEntireText = "&Увесь текст";
sTxtInterface  = "Мова інтерфейсу";
sTxtSourceInCB = "Source text from Clipboard";                                 //new
sTxtSourceWnd  = "Показати вікно з джерелом";                                  //changed in English: "Show panel with source text"
sTxtLoadText   = "Load source text to panel at start";                         //changed
sTxtImmediate  = "Одразу розпочати переклад";
sTxtWordWrap   = "Переносити стрічки";
sTxtFontAP     = "Font from AkelPad";                                          //new (previously was: sTxtUseFontAP = "Використовувати шрифт AkelPad";)
sTxtFontGUI    = "GUI font";                                                   //new
sTxtSortLang   = "Упорядкування мов";
sTxtSortCode   = "За кодом";
sTxtSortName   = "За іменем";
sTxtOwnKey     = "власний ключ";
sTxtRegister   = "Реєстрація:";
sTxtOK         = "Добре";
sTxtCancel     = "Скасувати";
sTxtError      = "Помилка";
sTxtNoText     = "Нічого перекладати.";
sTxtNoSupport  = "Ваша система не підтримує XMLHttpRequest.";
sTxtNoInternet = "Виявлено проблему із підключення до Інтернету.";
sTxtWait       = "Зачекайте...";
sTxtUndefined  = "Невизначено";
sTxtRegScripts = "You must register library: Scripts.dll";                     //new
sTxtNoLibrary  = "Can not load library: ";                                     //new

aLangs[ 0][1] = "Африкаанс";
aLangs[ 1][1] = "Арабська";
aLangs[ 2][1] = "Білоруська";
aLangs[ 3][1] = "Болгарська";
aLangs[ 4][1] = "Каталоньска";
aLangs[ 5][1] = "Чеське";
aLangs[ 6][1] = "Валлійська";
aLangs[ 7][1] = "Датська";
aLangs[ 8][1] = "Німецька";
aLangs[ 9][1] = "Грецька";
aLangs[10][1] = "Англійська";
aLangs[11][1] = "Esperanto";                                                   //new
aLangs[12][1] = "Іспанська";
aLangs[13][1] = "Естонська";
aLangs[14][1] = "Перська";
aLangs[15][1] = "Фінська";
aLangs[16][1] = "Французька";
aLangs[17][1] = "Ірландська";
aLangs[18][1] = "Галійська";
aLangs[19][1] = "Хінді";
aLangs[20][1] = "Хорватська";
aLangs[21][1] = "Креольска";
aLangs[22][1] = "Угорська";
aLangs[23][1] = "Індонезійська";
aLangs[24][1] = "Ісландська";
aLangs[25][1] = "Італійська";
aLangs[26][1] = "Іврит";
aLangs[27][1] = "Японська";
aLangs[28][1] = "Корейська";
aLangs[29][1] = "Латинь";
aLangs[30][1] = "Литовська";
aLangs[31][1] = "Латвійська";
aLangs[32][1] = "Македонська";
aLangs[33][1] = "Малайська";
aLangs[34][1] = "Мальтійська";
aLangs[35][1] = "Голландська";
aLangs[36][1] = "Норвезька";
aLangs[37][1] = "Польська";
aLangs[38][1] = "Португальська";
aLangs[39][1] = "Румунська";
aLangs[40][1] = "Російська";
aLangs[41][1] = "Словацька";
aLangs[42][1] = "Словенська";
aLangs[43][1] = "Албанська";
aLangs[44][1] = "Сербська";
aLangs[45][1] = "Шведська";
aLangs[46][1] = "Суахілі";
aLangs[47][1] = "Тайська";
aLangs[48][1] = "Філіппінська";
aLangs[49][1] = "Турецька";
aLangs[50][1] = "Українська";
aLangs[51][1] = "В'єтнамська";
aLangs[52][1] = "Їдиш";
aLangs[53][1] = "Китайська";
aLangs[54][1] = "Китайська спрощена";
aLangs[55][1] = "Китайська Традиційна";